SecurityEvent
| where EventID == 4662
| where ObjectType contains "domainDNS"
| where Properties has_any ("Replicating Directory Changes", "1131f6ad-9c07-11d1-f79f-00c04fc2dcd2", "1131f6aa-9c07-11d1-f79f-00c04fc2dcd2")
| project-reorder TimeGenerated, Computer, SubjectUserName, SubjectDomainName, ObjectName